import 'package:flutter/material.dart';
import 'package:flutter/rendering.dart';
import 'package:splash/Quran_other_Page.dart';

List<String> suraNameList=[
  "১.সুরা ফাতিহা",
  "২.সুরা বাকারা",
  "৩.সুরা ইমরান",
  "৪.সুরা নিসা",
  "৫.সুরা মায়িদাহ",
  "৬.সুরা আনআম",
  "৭.সুরা আরাফ",
  "৮.সুরা অনফাল",
  "৯.সুরা তাওবাহ্",
  "১০.সুরা ইউনুস",
  "১১.সুরা হুদ",
  "১২.সুরা ইউসুফ",
  "১৩.সুরা রা’দ",
  "১৪.সুরা ইব্রাহিম",
  "১৫.সুরা হিজর",
  "১৬.সুরা নাহল",
  "১৭.সুরা বনী-ইসরাইল",
  "১৮.সুরা কাহাফ",
  "১৯.সুরা মারইআম",
  "২০.সুরা ত্বোয়াহ",
  "২১.সুরা আম্বিয়া",
  "২২.সুরা হাজ্জ্ব",
  "২৩.সুরা মু’মিনূন",
  "২৪.সুরা আন-নূর",
  "২৫.সুরা ফুরকান ",
  "২৬.সুরা শুআরা",
  "২৭.সুরা নমল",
  "২৮.সুরা কাসাস",
  "২৯.আনকাবুত",
  "৩০.আর রুম",
  "৩১.সুরা লোকমান",
  "৩২.সুরা সেজদাহ্",
  "৩৩.সুরা আহযাব",
  "৩৪.সুরা সাবা",
  "৩৫.সুরা ফাতির",
  "৩৬.সুরা ইয়াসিন",
  "৩৭.সুরা আস ছাফফাত",
  "৩৮.সুরা ছোয়াদ",
  "৩৯.সুরা যুমার",
  "৪০.সুরা মু’মিন",
  "৪১.সুরা হা-মিম-সেজদাহ্",
  "৪২.সুরা আশ্-শূরা",
  "৪৩.সুরা আয্-যুখরুফ",
  "৪৪.সুরা আদ দোখান",
  "৪৫.সুরা আল জাসিয়াহ",
  "৪৬.সুরা আল-আহকাফ",
  "৪৭.সুরা মুহাম্মদ",
  "৪৮.সুরা ফাতাহ",
  "৪৯.সুরা হুজরাত",
  "৫০.সুরা ক্বাফ",
  "৫১.সুরা যারিয়াত",
  "৫২.সুরা তূর",
  "৫৩.সুরা নাজর",
  "৫৪.সুরা ক্বামার",
  "৫৫.সুরা রহমান",
  "৫৬.সুরা ওয়াক্বিয়াহ্",
  "৫৭.সুরা হাদিদ",
  "৫৮.সুরা মুজাদালাহ্",
  "৫৯.সুরা হাশর",
  "৬০.সুরা মুমতাহিনাহ",
  "৬১.সুরা সাফ",
  "৬২.সুরা জুমুআহ",
  "৬৩.সুরা মুনাফিকূন",
  "৬৪.সুরা তাগাবুন",
  "৬৫.সুরা ত্বালাক",
  "৬৬.সুরা তাহরীম",
  "৬৭.সুরা ‍মুলক",
  "৬৮.সুরা ক্বলম",
  "৬৯.সুরা হাক্কাহ",
  "৭০.সুরা মাআরিজ",
  "৭১.সুরা নূহ",
  "৭২.সুরা আল জ্বিন",
  "৭৩.সুরা আল মুযযাম্মিল",
  "৭৪.সুরা আল মুদ্দাসসির",
  "৭৫.সুরা ক্বিয়ামাহ্",
  "৭৬.সুরা অদ দাহর",
  "৭৭.সুরা অল মুরসালাহ",
  "৭৮.সুরা আন নাবা",
  "৭৯.সুরা নাযিয়াত",
  "৮০.সুরা আবাসা",
  "৮১.সুরা আত তাকভীর",
  "৮২.সুরা ইনফিতার",
  "৮৩.সুরা মুত্বাফফিফীন",
  "৮৪.সুরা আল ইনশিকাফ",
  "৮৫.সুরা আল বুরুজ",
  "৮৬.সুরা আত তারিক্ব",
  "৮৭.সুরা আ’লা",
  "৮৮.সুরা গাশিয়াহ্",
  "৮৯.সুরা ফাজর",
  "৯০.সুরা বালাদ",
  "৯১.সুরা শামস",
  "৯২.সুরা আল লাইল",
  "৯৩.সুরা দুহা",
  "৯৪.সুরা ইনশিরাহ",
  "৯৫. ত্বীন",
  "৯৬.সুরা আলাক",
  "৯৭.সুরা ক্বাদর",
  "৯৮.সুরা বাইয়্যনাহ",
  "৯৯.সুরা আল যিলযাল",
  "১০০.সুরা আদিয়াত",
  "১০১.সুরা ক্বারিয়াহ্",
  "১০২.সুরা আত তাকাসুর",
  "১০৩.সুরা আল আছর",
  "১০৪.সুরা হুমাযাহ",
  "১০৫.সুরা ফীল",
  "১০৬.সুরা কুরাইশ",
  "১০৭.সুরা মাঊন",
  "১০৮.সুরা কাউসার",
  "১০৯.সুরা কাফিরুন",
  "১১০.সুরা নাসর",
  "১১১.সুরা লাহাব",
  "১১২.সুরা ইখলাস",
  "১১৩.সুরা ফালাক",
  "১১৪.সুরা নাস"
];

List <String> suraAeat=[
  "  بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيم  ِ"
      "\n"
      " শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
      "\n"
      "In the name of Allah, Most Gracious, Most Merciful."
      "\n"
      "\n"
      "১)  الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ "
      "\n"
"১) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
      "\n"
"১)Praise be to Allah, the Cherisher and Sustainer of the worlds"
      "\n"
      "\n"
      " ৩)   الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
"৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
      "\n"
      "3)Most Gracious, Most Merciful;\n"
      "\n"

      "৪)  مَالِكِ يَوْمِ الدِّين  "
      "\nِ"
"৪) যিনি বিচার দিনের মালিক।\n"
"4) Master of the Day of Judgment.\n"
      " ৫)  إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"

      "৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
      "5)Thee do we worship, and Thine aid we seek.\n"
      "\n"
      "৬) اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ  "
      "\n"
      "৬) আমাদেরকে সরল পথ দেখাও,\n"
      "6)Show us the straight way,\n"
      "\n"
      "  ৭) صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
      "\n"
      "৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"
  ,
      "  ৭)   بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
"১) শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
"\n"
"1)In the name of Allah, Most Gracious, Most Merciful."
"\n"
"الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ"
"\n"
"২) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
"\n"
"Praise be to Allah, the Cherisher and Sustainer of the worlds"
"\n"
"الرَّحْمَـٰنِ الرَّحِيمِ"
"\n"
"৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
"\n"
"Most Gracious, Most Merciful;\n"

"مَالِكِ يَوْمِ الدِّين\nِ"
"৪) যিনি বিচার দিনের মালিক।\n"
"Master of the Day of Judgment.\n"
"إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"
"৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
"Thee do we worship, and Thine aid we seek.\n"
"اهْدِنَا الصِّرَاطَ الْمُسْتَقِيم\nَ"
"৬) আমাদেরকে সরল পথ দেখাও,\n"
"Show us the straight way,\n"
"\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
"৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"
          "  بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيم  ِ"
          "\n"
          " শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
          "\n"
          "In the name of Allah, Most Gracious, Most Merciful."
          "\n"
          "\n"
          "১)  الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ "
          "\n"
          "১) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
          "\n"
          "১)Praise be to Allah, the Cherisher and Sustainer of the worlds"
          "\n"
          "\n"
          " ৩)   الرَّحْمَـٰنِ الرَّحِيمِ"
          "\n"
          "৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
          "\n"
          "3)Most Gracious, Most Merciful;\n"
          "\n"

          "৪)  مَالِكِ يَوْمِ الدِّين  "
          "\nِ"
          "৪) যিনি বিচার দিনের মালিক।\n"
          "4) Master of the Day of Judgment.\n"
          " ৫)  إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"

          "৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
          "5)Thee do we worship, and Thine aid we seek.\n"
          "\n"
          "৬) اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ  "
          "\n"
          "৬) আমাদেরকে সরল পথ দেখাও,\n"
          "6)Show us the straight way,\n"
          "\n"
          "  ৭) صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
          "\n"
          "৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"

  ,
  "    بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "১) শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
      "\n"
      "1)In the name of Allah, Most Gracious, Most Merciful."
      "\n"
      "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ"
      "\n"
      "২) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
      "\n"
      "Praise be to Allah, the Cherisher and Sustainer of the worlds"
      "\n"
      "الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
      "\n"
      "Most Gracious, Most Merciful;\n"

      "مَالِكِ يَوْمِ الدِّين\nِ"
      "৪) যিনি বিচার দিনের মালিক।\n"
      "Master of the Day of Judgment.\n"
      "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"
      "৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
      "Thee do we worship, and Thine aid we seek.\n"
      "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيم\nَ"
      "৬) আমাদেরকে সরল পথ দেখাও,\n"
      "Show us the straight way,\n"
      "\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
      "৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"
  ,
  "    بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "১) শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
      "\n"
      "1)In the name of Allah, Most Gracious, Most Merciful."
      "\n"
      "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ"
      "\n"
      "২) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
      "\n"
      "Praise be to Allah, the Cherisher and Sustainer of the worlds"
      "\n"
      "الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
      "\n"
      "Most Gracious, Most Merciful;\n"

      "مَالِكِ يَوْمِ الدِّين\nِ"
      "৪) যিনি বিচার দিনের মালিক।\n"
      "Master of the Day of Judgment.\n"
      "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"
      "৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
      "Thee do we worship, and Thine aid we seek.\n"
      "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيم\nَ"
      "৬) আমাদেরকে সরল পথ দেখাও,\n"
      "Show us the straight way,\n"
      "\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
      "৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"
  ,
  "    بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "১) শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
      "\n"
      "1)In the name of Allah, Most Gracious, Most Merciful."
      "\n"
      "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ"
      "\n"
      "২) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
      "\n"
      "Praise be to Allah, the Cherisher and Sustainer of the worlds"
      "\n"
      "الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
      "\n"
      "Most Gracious, Most Merciful;\n"

      "مَالِكِ يَوْمِ الدِّين\nِ"
      "৪) যিনি বিচার দিনের মালিক।\n"
      "Master of the Day of Judgment.\n"
      "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"
      "৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
      "Thee do we worship, and Thine aid we seek.\n"
      "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيم\nَ"
      "৬) আমাদেরকে সরল পথ দেখাও,\n"
      "Show us the straight way,\n"
      "\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
      "৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"
  ,
  "    بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "১) শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
      "\n"
      "1)In the name of Allah, Most Gracious, Most Merciful."
      "\n"
      "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ"
      "\n"
      "২) যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।"
      "\n"
      "Praise be to Allah, the Cherisher and Sustainer of the worlds"
      "\n"
      "الرَّحْمَـٰنِ الرَّحِيمِ"
      "\n"
      "৩) যিনি নিতান্ত মেহেরবান ও দয়ালু।"
      "\n"
      "Most Gracious, Most Merciful;\n"

      "مَالِكِ يَوْمِ الدِّين\nِ"
      "৪) যিনি বিচার দিনের মালিক।\n"
      "Master of the Day of Judgment.\n"
      "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِين\nُ"
      "৫) আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\n"
      "Thee do we worship, and Thine aid we seek.\n"
      "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيم\nَ"
      "৬) আমাদেরকে সরল পথ দেখাও,\n"
      "Show us the straight way,\n"
      "\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ"
      "৭) সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।"
  ,

];
class Quran extends StatefulWidget {
  const Quran({Key? key}) : super(key: key);

  @override
  _QuranState createState() => _QuranState();
}

class _QuranState extends State<Quran> {

  @override
  Widget build(BuildContext context) {
   double height=MediaQuery.of(context).size.height;
   double width=MediaQuery.of(context).size.width;
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Colors.green,
        title: Text("কোরআন ৩০ পারা"),
      ),
      body: ListView.builder(
        itemCount: suraNameList.length,

          itemBuilder: (context,index){
        return Column(
          children: [
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: InkWell(
                onTap: (){
                  Navigator.push(context, MaterialPageRoute(builder: (context)=>QuranOther(
                    suraName: suraNameList[index],Aeat: suraAeat[index],
                  )));
                },

                child: Container(

                  width: width*0.7,
                  height: 50,
                  color: Colors.deepOrange,
                  child: Center(
                    child: Text(suraNameList[index],style: TextStyle(
                        color: Colors.white,fontSize: 25,fontWeight: FontWeight.bold),),
                  ),
                ),
              ),
            ),
          ],
        );
      }
      ),
    );
  }
}
